{"books":[{"id":"1","name":"A Structure Programming Approach Using C","author":"Bezhrouz A.Frorouzan,Richard F.Gilberg","publication":"Cengage Learning","isbn":"8131503631","price":"496","category":"Computer Science Engineering","description":"A structured  progammimg approach using c continues to presebt both computer science theory and C-language syntax with a principle-before-implementation approach.Forouzan and Gilberg employs a clear organizational structure,supplemented by easy-to-follow figures,charts and and tables. The new edition has been thoroughly updated to reflect the new C99 standard and includes a revised chapter sequence to better aid student learning."},{"id":"2","name":"A Structured Approach Using C++","author":"Behrouz A. Forouzan,Richard F. Gilberg","publication":"Cengage Learning","isbn":"8131501124","price":"569","category":"Computer science engineering","description":"Behrouz Forouzan and Richard Gilberg consistently emphasize the principles of structured programming and software engineering. Every complete program uses a consistent style and as programs are analyzed, styles and standards are further explained. Whenever possible, the authors develop the principle of a subject before they introduce the language implementation so the student understands the concept before dealing with the nuances of C++. In addition, a vast array of figures and tables visually reinforce key concepts. By integrating software engineering principles and encouraging the student to resist the temptation to immediately code, the text builds a solid foundation in problem solving"},{"id":"3","name":"Fundamentals of Software Engineering","author":"Mall B","publication":" PHI Learning Private Limited-New Delhi","isbn":"8120348982","price":"605","category":"computer science engineering","description":"Advancements and rapid developments have led to many ramifications in the ever-changing world of software engineering. This book, in its Fourth Edition, is restructured and extensively revised to trace the advancements made and landmarks achieved in the field. This book not only incorporates latest and enhanced software engineering techniques and practices but also shows how these techniques are applied into the practical software assignments. The chapters are incorporated with illustrative examples to add an analytical insight on the subject. The book is logically organised to cover expanded and revised treatment of all software process activities. New to This Edition* The contents and presentation of all chapters have been improved thoroughly. * Objective type questions have been included in all the chapters. * More practice questions have been added to help students understanding the concepts readily. * McCall's quality factors and ISO 9126 have been introduced in the chapter dealing with software quality assurance (Chapter 11). * Primarily intended for the undergraduate students of Computer Science and Engineering, the book is also beneficial for the students opting for a course in MCA, MBA and IT. Key Features* Large number of worked-out examples and practice problems. * Chapter-end exercises and solutions to selected problems to check students' comprehension on the subject. * Solutions manual available for instructors"},{"id":"4","name":"Foundations of Software Testing ISTQB Certification","author":"Dorothy Graham","publication":"Cengage","isbn":"1404044056","price":"3999","category":"computer science engineering","description":"Foundations of Software Testing: ISTQB Certification is the essential guide to software testing and to the ISTQB Foundation qualification. Completely updated to comprehensively reflect the most recent changes to the ISTQB Foundation Syllabus, the book adopts a practical, hands-on approach, covering the fundamental topics that every system and software tester should know. The authors are themselves developers of the ISTQB syllabus and are highly respected international authorities, teachers and authors within the field of software testing."},{"id":"4","name":"Computer Organization and Design: The Hardware/Software Interface","author":"David A. Patterson","publication":"Morgan Kaufmann Publishers In","isbn":"0123706068","price":"500","category":"computer science engineering","description":"The same great book gets better! This revised printing features all of the original content along with these additional features: Appendix A (Assemblers, Linkers, and the SPIM Simulator) has been moved from the CD-ROM into the printed book as well as corrections and bug fixes. Third edition features the following new pedagogical features. Understanding Program Performance - analyzes key performance issues from the programmer's perspective. Check Yourself Questions - helps students assess their understanding of key points of a section. Computers In the Real World - illustrates the diversity of applications of computing technology beyond traditional desktop and servers. For More Practice - provides students with additional problems they can tackle. In More Depth - presents new information and challenging exercises for the advanced student. New reference features: highlighted glossary terms and definitions appear on the book page, as bold-faced entries in the index, and as a separate and searchable reference on the CD; a complete index of the material in the book and on the CD appears in the printed index and the CD includes a fully searchable version of the same index; Historical Perspectives and Further Readings have been updated and expanded to include the history of software R and, CD-Library provides materials collected from the web which directly support the text."},{"id":"6","name":"Objective Electrical Technology","author":"V.K. Mehta,Rohit Mehta","publication":"S Chand; 2nd New edition edition","isbn":"8121920973","price":"670","category":"electrical science engineering","description":"For the students of U.P.S.C. (Engineering Services), IAS (Engineering Group), B.Sc. Engineering, Diploma and other Competitive Courses. More than 3500 objective Questions with hints are included in the book."},{"id":"7","name":"Electrical Engineering Fundamentals ","author":"Toro Vincent Del","publication":" Pearson Education","price":"503","category":"electrical science engineering","description":"Electrical Engineering Fundamentals focuses on the five principal zones within the discipline of electrical engineering. The author also develops new content that is more attuned to the needs of the students and uses new fundamental laws to clarify the concepts and ideas in a more structured manner. The second edition of the book, Electrical Engineering Fundamentals is intended to be put in use where Del Toro's other text, Principles of Electrical Engineering is being used. As a text, although it is primarily designed for students of electrical engineering, non-majors can subscribe to the text easily because of its accessible content. The student can use the Classical Method or the Laplace Transform Method to solve problems"},{"id":"8","name":"A Textbook of Electrical Technology: Volume 2 AC and DC Machines","author":"B.L. Theraja,A.K. Theraja","publication":"S Chand; 23rd Revised edition edition","isbn":"8121924375","price":"540","category":"electrical science engineering","description":"A Textbook Of Electrical Technology: Volume 2 AC And DC Machines elaborately covers the topics, AC and DC machines, which is a part of Electrical Technology. Electrical technology, as a subject, covers various divisions of electrical engineering like basic electrical engineering, electronics, control systems, instrumentation and communication systems.The book discusses and explains various theories related to AC and DC machines. The chapters consist of various exercises, examples, and multiple illustrations that aid in understanding the subject better."},{"id":"9","name":"BASIC ELECTRICAL ENGINEERING","author":"Abhijit Chakrabarti,Sudipta Nath,Chandan Chanda","publication":" McGraw Hill Education (India) Private Limited","isbn":"0070669309","price":"650","category":"electrical science engineering","description":"This book on Basic Electrical Engineering , meant for undergraduate students of all disciplines, encompasses every detail about the required topics as per the syllabi in a student friendly style. Wide variety of problems and the right theoretical depth makes this book a perfect offering on the subject."},{"id":"10","name":"Textbook of Electrical Technology - Vol. 1","author":" B.L. Theraja,A.K. Theraja ","publication":" S Chand; 23rd Revised edition edition ","isbn":"8121924405","price":"539","category":"electrical science engineering","description":"This book has been thoroughly revised and enlarged and will be an asset to both Electrical as well as non Electrical Students pursuing their studies in different branches of Engineering."},{"id":"11","name":"A Textbook of Thermal Engineering: Mechanical Technology","author":"S. Khurmi","publication":"S Chand","isbn":"8121925738","price":"480","category":"Mechanical science engineering","description":"Books for B.Tech, B.E. B.Arch. and other Engineering courses. A textbook for the students of B.Sc. Engineering, UPSC (Engineering Services), Section 'B' of AMIE (1) and Diploma Courses. The present Edition of this treatise has been thoroughly revised and brought up to date. Two new chapters on General Thermodynamic Relations and Variable Specific Heat have been added."},{"id":"12","name":"Manufacturing Engineering and Technology","author":" Serope Kalpakjian ","publication":"Pearson Education","isbn":"8177581708","price":"446","category":"mechanical science engineering","description":"An indispensable text on the subject, the fourth edition of this book retains it emphasis on (a) the influence of materials and processing parameters in understanding manufacturing processes and operations (b) design considerations, product quality and manufacturing cost factors and (c) the domestic and global competitive context of each manufacturing process and operation, highlighted with illustrative examples."},{"id":"13","name":"Basics of Mechanical Engineering","author":"R.K.Singal,Mridual Singal,Rishi Singal","publication":" I K International Publishing House Pvt. Ltd","isbn":"8189866206","price":"238","category":"mechanical science engineering","description":"Basics of Mechanical Engineering systematically develops the concepts and principles essential for understanding engineering thermodynamics, mechanics and strength of materials. This book is meant for first year B.Tech students. It will also be helpful for candidates preparing for examinations."},{"id":"14","name":"Elements of Mechanical Engineering","author":"Manglik V.K","publication":"PHI Learning Private Limited","isbn":"8120346297","price":"391","category":"","description":"This book provides a comprehensive and wide-ranging introduction to the fundamental principles of mechanical engineering in a distinct and clear manner. The book is intended for a core introductory course in the area of foundations and applications of mechanical engineering, prescribed for the first-year students of all disciplines of engineering. The book develops an intuitive understanding of the basic principles of thermodynamics as well as of the principles governing the conversion of heat into energy. Numerous illustrative examples are provided to fortify these concepts throughout."},{"id":"15","name":"Manufacturing Technology - Vol. 2","author":" P.N. Rao","publication":"McGraw Hill Education (India) Private Limited","isbn":"125902956","price":"370","category":"mechanical science engineering","description":"The third edition of this text has been thoroughly revised, updated and made more comprehensive with the latest practices. Lucid presentation, expanded topical coverage and rich pedagogy make this an excellent book for students, teachers and practicing engineers."},{"id":"16","name":"Civil Engineering: Conventional and Objective Type","author":" R. S. Khurmi","publication":" S Chand","isbn":"812192605X","price":"430","category":"civil science engineering","description":"Covers applied mechanics, strength of materials, hydraulics and fluids mechanics, hydraulic machines, building material irrigation, engineering, public health engineering, and concrete technology."},{"id":"17","name":"Estimating and Costing in Civil Engineering: Theory and Practice Including Specifications and Valuations","author":"UBS Publishers & Distributors ","publication":"UBS Publishers & Distributors Ltd","isbn":"8174767290","price":"495","category":"civil science engineering","description":"The book is complete in all respects in theory and practice, and covers the syllabi of degree, diploma, certificate and draftsman courses. It is based on the departmental practice and I.S.I. specifications. Technical data, tables, conversion tables and other information of practical nature are all given in the book. Besides these, the book contains a number of drawings and plates of practical nature, which would be useful for civil engineering, drawing and designing. In addition to estimating, costing, analysis of rates, specifications, etc., the book contains many other chapters, practical"},{"id":"18","name":"Elements of Civil Engineering & Engineering Mechanics Semester - I / II for VTU ","author":" Sawant H ","publication":"l t t pvt Ltd","isbn":"9350388111","price":"395","category":"civil engineering","description":"The fourth edition contains everything that engineering faculty and students, as well as fresh engineers commencing their career in the field need know about the subject. Section I (Civil Engineering Contracts) presents an introduction to the legal aspects involved right from the tender stage up to planning. It also discusses project scheduling through management techniques such as PERT and CPM. Further, it furnishes useful information on the law of contracts, specifications and contract management. Section II (Civil Engineering Estimates) provides the basic framework which enables the reader to accurately estimate the costs of projects by using the method of measurement of works. A variety of projects are included such as residential construction and building of bridges."},{"id":"19","name":"Civil Engineering Contracts and Estimates","author":" B.S. Patil","publication":"Orient Blackswan Private Ltd","isbn":"8173719578","price":"498","category":"civil engineering","description":"Civil Engineering Contracts and Estimates, Fourth Edition, combines in a single book, two important sections of Civil Engineering—Contracts and Estimates. The first edition was designed to serve as a textbook for engineering courses without any need for frequent changes. Improved contract conditions and management techniques were taken care of in the second edition. The use of FIDIC and other similar standard contract forms, particularly Public Private Partnership (PPP), construction of public works on build, operate and transfer (BOT) basis and other developments necessitated the third edition."},{"id":"20","name":"Irrigation Engineering","author":"Gurcharan Singh","publication":"Standard Book House","isbn":" 8189401327","price":"450","category":"civil engineering","description":"The book has completely been revised, enlarged and updated. Latest Indian Standards pertaining to the design of various irrigation structures have been incorporated. Lot of latest literature has been added in almost all the chapters so that book may fulfil the latest needs of both degree and diploma students of civil engineering."},{"id":"21","name":"Unit Operations of Chemical Engineering","author":"Warren McCabe,Julian Smith","publication":"McGraw Hill Education (India) Private Limited","isbn":"9339213238","price":"695","category":"Chemical engineering","description":"Now in its seventh edition, the text still contains its balanced treatment of theory and engineering practice, with many practical, illustrative examples included. Almost 30% of the problems have been revised or are new, some of which cover modern topics such as food processing and biotechnology. Other unique topics of this text include diafiltration, adsorption and membrane operations."},{"id":"22","name":"Chemical Engineering: A Comprehensive Approach","author":" K S Lakhi,B Viswanathan","publication":"Narosa Publishing House","isbn":"8184872070","price":"461","category":"Chemical engineering","description":"A Comprehensive Approach Chemical Engineering: A Comprehensive Approach will overcome the difficulties experienced by field operators who want to enhance their basic theoretical knowledge of various unit operations and process equipments and panel operators and fresh chemical engineering graduates who want to revise and revisit various fundamental chemical engineering concepts. "},{"id":"23","name":"Chemical Reaction Engineering","author":" Octave Levenspiel","publication":"Wiley; Third edition","isbn":"1439855013","price":"470","category":"Chemical engineering","description":"Chemical reaction engineering is concerned with the exploitation of chemical reactions on a commercial scale. It's goal is the successful design and operation of chemical reactors. This text emphasizes qualitative arguments, simple design methods, graphical procedures, and frequent comparison of capabilities of the major reactor types. Simple ideas are treated first, and are then extended to the more complex. · Introduction to Reactor Design · Design for Single Reactions · Design for Parallel Reactions · Potpourri of Multiple Reactions · Compartment Models · The Dispersion Model · The Tank-in-Series Model · Substrate Limiting Microbial Fermentation · Product Limiting Microbial Fermentation · Fluid-Fluid Reactions: Kinetics · Fluid-Particle Reactions: Design · Enzyme Fermentation · Solid Catalyzed Reactions"},{"id":"24","name":"Chemical Engineering:Chemical Engineering Design-Vol.6","author":"Sinnott ","publication":" Elsevier; 5 edition","isbn":"9380501161","price":"750","category":"Chemical engineering","description":"Besides numerous illustrations, the book contains over 200 worked examples, over 400 exercise problems (all with answers) and several objective-type questions, which enable students to gain an in-depth understanding of the concepts and theory discussed. The book will also be a useful text for students pursuing courses in chemical engineering-related branches such as polymer engineering, petroleum engineering, and safety and environmental engineering."},{"id":"25","name":"A Textbook of Chemical Engineering Thermodynamics","author":"Narayanan K.V ","publication":"PHI; 2nd edition edition","isbn":"8120347471","price":"316","category":"Chemical engineering","description":"The book gives comprehensive coverage of basic concepts and applications of the laws of thermodynamics in the initial chapters, while the later chapters focus at length on important areas of study falling under the realm of chemical thermodynamics. The reader is thus introduced to a thorough analysis of the fundamental laws of thermodynamics as well as their applications to practical situations. This is followed by a detailed discussion on relationships among thermodynamic properties and an exhaustive treatment on the thermodynamic properties of solutions. The role of phase equilibrium thermodynamics in design, analysis, and operation of chemical separation methods is also deftly dealt with"},{"id":"26","name":"Half Girlfriend","author":"Chetan Bhagat","publication":"RupaAndCo; 3rd edition (1 October 2014)","isbn":"8129125728","price":"88","category":"Novels","description":"Once upon a time, there was a Bihari boy called Madhav. He fell in love with girl called Riya. Madhav didn't speak English well. Riya did. Madhav wanted a relationship. Riya didn't. Riya just wanted friendship. Madhav didn't. Riya suggested a compromise. She agreed to be his half-girlfriend. From the author of the blockbuster novels Five Point Someone, One Night @ the Call Center, The 3 Mistakes of My Life, 2 States and Revolution 2020 comes a simple and beautiful love story that will touch your heart and inspire you to chase your dreams."},{"id":"27","name":"What Young India Want","author":"Chetan Bhagat","publication":"Amazon Publishing","price":"132","category":"Novels","description":"Why is the suicide rate so high among students?Why is there so much corruption in India?Can’t our political parties ever work together?Does our vote make any difference at all?We love our India, but shouldn’t some things be different?All of us have asked these questions at some time or another. So does Chetan Bhagat, India’s best-loved author, in What Young India Wants, his first book of non-fiction, which is based on his vast experience as a successful writer and motivational speaker. In clear prose and with great insight, he analyses some of the complex issues facing modern India, offers solutions and invites discussion, and comes, at the end, to a simple but important question: unless we are all in agreement on what it is going to take to make our country better, how will things ever change?If you want to understand contemporary India, the problems that face it, and want to be a part of the solution, What Young India Wants is the book for you."},{"id":"28","name":"Revolution 2020: Love.Corruption.Ambition","author":"Chetan Bhagat","publication":"Rupa (1 September 2011)","isbn":"8129118807","price":"185","category":"Novels","description":"A tale of dreams, ambitions and unrequited love, Revolution 2020: Love. Ambition. Corruption. explores the lives of three friends from Varanasi, while also painting a stark picture of the country's corrupt political landscape.                          Gopal and Raghav are friends who hail from different backgrounds, but share a common hunger for success and realizing their dreams in life. Gopal, whose family has been mired in a never-ending property dispute, yearns to break out and amass wealth, while Raghav harbors dreams of disrupting the political milieu with his ideas of revolutionary change. Their lives take a surprising turn when they fall in love with a mutual friend, Aarti-a move that adds a new layer of complexity to their existing relationship. Aarti, meanwhile, is torn between her feelings for the defiant Raghav and ambitious Gopal. The plot thickens as Gopal gives in to the corrupt system that Raghav is trying to fight to fuel his thirst for riches. Will the volatile situation turn the friends against each other? Will Raghav be successful in his quest for rapid social change? And more importantly, will their closely entwined love lives alter their future forever? in Chetan Bhagat's signature style, Revolution 2020: Love. Ambition. Corruption. charges forward to answer all these questions."},{"id":"29","name":"The 3 Mistakes of My Life","author":"Chetan Bhagat ","publication":" Rupa Publications India; 2nd edition edition (1 January 2014)","isbn":"8129135515","price":"165","category":"Novels","description":"Many writers are successful at expressing what’s in their hearts or articulation of particular point of view. Chtean Bhagat’s books do both and more. - A R Rahman in Time magazine, on Chetan’s inclusion in the Time 100 Most Influential People in the world. India’s Paperback King- The Guardian.The biggest- selling English –language novelist in India’s history- The New York Times. A rockstar of Indian Publishing – The Times of India. Bhagat has touched a nerve with young Indian readers and acquired almost cult status – International Herald Tribune. In late 2000, a young boy in Ahmedabad dreams of owning a business. To accommodate his friends’ passion, he opens a cricket shop. However, nothing comes easy in a turbulent city. To realise their goals, they will have to face it all—religious politics, calamities, unacceptable love and, above all, their own mistakes. Will they make it? Can an individual’s dreams overcome the nightmares of real life? Can we succeed despite mistakes? Based on real events, from bestselling author Chetan Bhagat comes another dark, witty tale about modern India, where the author brings the ethos and isolation of an entire generation to the fore"},{"id":"30","name":"Adultery","author":"Paulo Coelho","publication":"Random House India","isbn":"8184006098","price":"299","category":"Novels","description":"Linda, in her thirties, begins to question the routine and predictability of her days. In everybody's eyes, she has a perfect life: happy marriage, children and a career. Yet what she feels is an enormous sense of dissatisfaction. All that changes when she encounters a successful politician who had, years earlier, been her high-school boyfriend. As she rediscovers the passion missing from her life, she will face a life altering choice."},{"id":"31","name":"The Alchemist","author":"Paulo Coelho","publication":"Harper; Later Printing edition (17 October 2005)","isbn":"8172234988","price":"225","category":"Novels","description":"The protagonist of The Alchemist is a young Andalusian shepherd who lives in Spain. He begins his journey to Egypt when he is chased by his frequent dreams of a mysterious child who coaxes him to look for treasure buried at the base of the Egyptian pyramids. He comes across Melchizedek, the king of Salem during his journey to Egypt. Santiago is enlightened by him to the concept of a 'Personal Legend' or a quest that would help him realize the core and depth of the desires buried in his heart. He meets an aspiring alchemist and a beautiful young woman en route. He also meets an alchemist who accompanies him in his expedition to enlighten him with his profound wisdom and knowledge. Through this journey he discovers the truths regarding why the treasure evades him each time. The Alchemist is a journey of wisdom, self-discovery and philosophy and finding your own 'Personal Legend' against the comparatively invaluable material possessions. It was first published in the year 1988. This particular edition from publisher Harper Collins was published on 17th October, 2005 and is available in paperback."},{"id":"32","name":"Veronika Decides to Die","author":"Paulo Coelho","publication":"Harper; New edition edition (17 October 2005)","isbn":"8172235437","price":"399","category":"Novels","description":"A beautiful young woman from Slovenia appears to have what most would call a perfect life. She has many boyfriends, a steady job and a loving family. She, on the other hand, is not happy. One day, she tries to commit suicide by ingesting too many sleeping pills. She reads a magazine awaiting her death. Her heart is damaged but her plan of suicide fails. She wakes up in Villete, a mental hospital in Slovenia as the overdose of sleeping pills does not work. She is told though, that she only has a few days to live due to the damage caused.                          At the mental hospital, Veronika falls in love with Eduvard, who is suffering froM. Sc.hizophrenia. Veronika now thinks that she has nothing to lose and starts enjoying her newfound freedom. She experiences emotions and feelings that she had restricted herself to before.                          Villete's head psychiatrist, Dr. Igor is meanwhile attempting a fascinating but provocative experiment. What is this experiment about and how does this concern Veronika?                          Veronika Decides to Die is loosely based on author Paul Coelho's experiences in mental institutions. It has been published in 46 languages and been adapted for theater movies a number of times.                          Veronika Decides to Die was published by Harper in 2005. It is available in paperback."},{"id":"33","name":"The Winner Stands Alone","author":"Paulo Coelho","publication":"Harper (2 April 2009)","isbn":"0007318685","price":"405","category":"Novels","description":"The Winner Stands Alone is a book that is loosely based on the ascendance of a group of people, that the author calls The Superclass. The Superclass are an elite, yet extremely small, section of the global population whose actions and behaviour influences the lives of the rest of the world.                          The story revolves around the worlds of cinema and fashion. It takes place over the course of a single day, and closely follows Igor, a Russian entrepreneur who will stop at nothing to get his ex-wife, Ewa, back. He considers her to be the love of his life. Igor is an individual force of evil, who is willing to destroy the entire world if he can reclaim Ewa. His struggle with society as a whole drives the plot and causes moralistic derailment.                          The Winner Stands Alone is set at the Cannes Film Festival, where The Superclass of filmmakers, actors, supermodels and other powerful and beautiful people mix with the has-beens and the hangers-on. The author reveals the dangers of society’s infatuation with fame and luxury, as he expertly weaves together the lives and paths of all the characters in this gripping tale.                          This book was published by Harper Publications in 2009 and is available in paperback."},{"id":"34","name":"Wings of Fire: An Autobiography","author":" A.P.J. Abdul Kalam","publication":"Universities Press; 1st edition (1999)","isbn":"8173711461","price":"495","category":"Autobiography","description":"Avul Pakir Jainulabdeen Abdul Kalam, the son of a little-educated boat-owner in Rameswaram, Tamil Nadu, had an unparalleled career as a defence scientist, culminating in the highest civilian award of India, the Bharat Ratna. As chief of the country’s defence research and development programme, Kalam demonstrated the great potential for dynamism and innovation that existed in seemingly moribund research establishments. This is the story of Kalam’s rise from obscurity and his personal and professional struggles, as well as the story of Agni, Prithvi, Akash, Trishul and Nag-missiles that have become household names in India and that have raised the nation to the level of a missile power of international reckoning. This is also the saga of independent India’s struggle for technological self-sufficiency and defensive autonomy-a story as much about politics, domestic and international, as it is about science."},{"id":"35","name":"Sachin Tendulkar: Playing it My Way - My Autobiography ","author":"Sachin Tendulkar","publication":"Hodder And Stoughton; 2014 edition (6 November 2014)","isbn":"1473605202","price":"380","category":"Autobiography","description":"I knew that if I agreed to write my story, I would have to be completely honest, as thats the way I have always played the game and that would mean talking about a number of things I have not addressed in public before. So here I am, at the end of my final innings, having taken that last walk back to the pavilion, ready to recount as many incidents as I can remember since first picking up a cricket bat as a child in Mumbai thirty-five years ago. - Sachin Tendulkar                                    Never has a cricketer been burdened with so many expectations never has a cricketer performed at such a high level for so long and with such style - scoring more runs and making more centuries than any other player, in both Tests and one-day games. And perhaps only one cricketer could have brought together a shocked nation by defiantly scoring a Test century shortly after terrorist attacks rocked Mumbai. His many achievements with India include winning the World Cup and topping the world Test rankings. Yet he has also known his fair share of frustration and failure - from injuries and early World Cup exits to stinging criticism from the press, especially during his unhappy tenure as captain.                          Despite his celebrity status, Sachin Tendulkar has always remained a very private man, devoted to his family and his country. Now, for the first time, he provides a fascinating insight into his personal life and gives a frank and revealing account of a sporting life like no other."},{"id":"36","name":"An Autobiography: Or, the Story of My Experiments with Truth","author":"mahatma gandhi,mahadev desai","publication":"Educa Books; Reprint edition (15 October 2010)","isbn":"8172290085","price":"299","category":"Autobiography","description":"Mohandas Karamchand Gandhi was born in Western India in 1869. He was educated in London and later travelled to South Africa, where he experienced racism and took up the rights of Indians, instituting his first campaign of passive resistance. In 1915 he returned to British-controlled India, bringing to a country in the throes of independence his commitment to non-violent change, and his belief always in the power of truth. Under Gandhi's lead, millions of protesters would engage in mass campaigns of civil disobedience, seeking change through ahimsa or non-violence. For Gandhi, the long path towards Indian independence would lead to imprisonment and hardship, yet he never once forgot the principles of truth and non-violence so dear to him. Written in the 1920s, Gandhi's autobiography tells of his struggles and  his inspirations; a powerful and enduring statement of an extraordinary life."},{"id":"37","name":"The Autobiography of Benjamin Franklin","author":"Benjamin Franklin","publication":"Simon And Schuster (6 January 2004)","isbn":"0743255062","price":"495","category":"Autobiography","description":"The Autobiography Of Benjamin Franklin is the unfinished record of his own life written by Benjamin Franklin from 1771 to 1790, and is now considered to be one of the most famous and influential examples of an autobiography ever written.                          Virtually self-taught, Franklin excelled as an athlete, a man of the written word, a scientist, a printer, an inventor, an editor, a philosopher and a writer with incredible wit, and he was probably the most successful diplomats in American history. The Autobiography Of Benjamin Franklin is segregated into four parts, each reflecting the different periods during which he wrote them. The book itself was written in three different times: 1771 in England, 1783-83 in France, and 1788 in America.                          Although remained unpublished during Franklin's lifetime, the first edition of the book was published in 1791 in French. He had written it with the intention of providing a guidance for his son, and is considered to be his best work which has gone on to secure a place in world literature. This edition was published by Touchstone in 2004, and is available in paperback."},{"id":"38","name":"steve jobs","author":"Walter Isaacson","publication":"Little, Brown Book Group; 2015 edition (11 February 2015)","isbn":"034914043X","price":"380","category":"Autobiography","description":"Based on more than forty interviews with Steve Jobs conducted over two years - as well as interviews with more than a hundred family members, friends, adversaries, competitors, and colleagues - this is the acclaimed, internationally bestselling biography of the ultimate icon of inventiveness. Walter Isaacson tells the story of the rollercoaster life and searingly intense personality of creative entrepreneur whose passion for perfection and ferocious drive revolutionized six industries: personal computers, animated movies,music, phones, tablet computing, and digital publishing. Although Jobs cooperated with this book, he asked for no control over what was written, nor even the right to read it before it was published. He put nothing off limits. He encouraged the people he knew to speak honestly. And Jobs speaks candidly, sometimes brutally so, about the people he worked with and competed against. His friends, foes, and colleagues provide an unvarnished view of the passions, perfectionism, obsessions, artistry, devilry, and compulsion for control that shaped his approach to business and the innovative products that resulted."},{"id":"39","name":"The Intelligent Investor","author":"Benjamin Graham","publication":"Harper Business (2013)","isbn":"0062312685","price":"279","category":"Economics","description":"Benjamin Graham inspired people everywhere in the world and is known to be the most famous investment advisor of the 20th century. His book The Intelligent Investor is recognized and believed to be the stock market bible since it was published in 1949 because of Graham's philosophy called Value Investing which explains to investors how to develop long term strategies and prevent errors.                          Famous investor, Warren Buffett, has described this book as the best book on investing ever written. The Intelligent Investor teaches us how to reach our goals financially and how to avoid the calculated risks involved. This book has become famous as being imperative for everyone in the business of investing.                          Our market has come a long way and the advancements are a proof of Graham's take on finance, his plans and ideas. Jason Zweig, a financial journalist infuses his outlook about how the market functions in today's world with Graham's examples and the current financial order and plans. This is what you can expect in the current revised edition of the book, while still safeguarding Graham's unique text. All this is done to make applying Graham's principles easier in day to day life."},{"id":"40","name":"Economic Survey 2015-2016 (Two-Volume Set)","author":" Ministry of Finance","publication":"OUP India (18 April 2016)","isbn":"0199469288","price":"620","category":"Economics","description":"The Ministry of Finance is an important ministry within the Government of India. It concerns itself with taxation, financial legislation, financial institutions, capital markets, centre and state finances, and the Union Budget."},{"id":"41","name":"An Inquiry into the Nature and Causes of the Wealth of Nations","author":"adam smith","publication":"University Of Chicago Press; Facsimile of 1904 ed edition (16 May 2012)","isbn":"1505577128","price":"599","category":"Economics","description":"This book was converted from its physical edition to the digital format by a community of volunteers."},{"id":"42","name":"Fault Line: How Hidden Fractures Still Threaten the World Economy","author":"raghuram rajan","publication":"Collins Business (1 January 2011)","isbn":"9350291738","price":"999","category":"Economics","description":"Fault Lines: How Hidden Fractures Still Threaten The World Economy is an enlightening book that aims to draw your attention to the fault lines that are present in the world's economy today. The author believes that these fault lines were responsible for the financial crisis that the world saw, in the year 2008. He also believes that the world could be in for some more severe financial situations, if the fault lines that are mentioned in this book are not attended to, immediately.                          The author mentions his belief that the financial meltdown experienced by the world has been due to these fault lines and not solely due to the choices made by individuals, such as government officials, bankers and homemakers. He believes that the decisions made by these people were made as a logical response to the fault lines in the world's economy."},{"id":"43","name":"Legal Eagles: Stories of the Top Seven Indian Lawyers","author":"indu bhan","publication":"Random House India (17 September 2015)","isbn":"8184006357","price":"279","category":"Law","description":"Legal Eagles is the story of India’s top seven litigation lawyers who fought some of the most important corporate battles in Indian courts. These stories chart their journey from their childhood days, marking important events in their lives. Their path to success is paved with determination, grit and challenges. The book also contains in-depth accounts of the single-biggest cases handled by each of these lawyers. These include the Vodafone Tax case, Coalgate (the coal block scam), the Reliance PMT Gas case, the Sahara scam and the 2G spectrum controversy. Journalist Indu Bhan gives the reader a ringside view of the lives of these legal eagles and India’s landmark corporate battles."},{"id":"44","name":"Govt. Officials to Master Noting And Draftin (DIC)","author":"M.K Agarwal","publication":"Pustak Mahal - New Delhi (2008)","isbn":"8122309844","price":"144","category":"Law","description":"A Book for Government Officials to Master Noting and Drafting is targeted towards all those aspirants who wish to learn the art of noting and drafting in any of the government procedures. This book is authored by M K Agarwal. Noting is an important practice under Right to Information Act and it requires a sleek skill of analysing things correctly and putting down in an appropriate language. This book is focussed upon helping the readers understand all the important areas that would help them note and draft effectively.                          Ideally, the task of noting has been done by an Office Assistant or an Assistant Section Officer, due to the complexity and skill required to do this job. The content of the book helps the readers to attain gradual mastery in writing good notes that meet all the expectations of defining the problem properly along with analysing it with rigour and detail, while having adhered to the relevant rules and regulations. Also, the one who is preparing a note should be able to provide alternate solutions, argue around the implications and draft the entire discussion."},{"id":"45","name":"Landmark Judgments That Changed India","author":"Asok Kumar Ganguly","publication":"Rupa Publications India; first edition (23 August 2015)","isbn":"8129135086","price":"277","category":"Law","description":"The executive, the legislature and the judiciary are the three branches of government, both state and central, in India. Of these, it is the judiciary’s task to uphold constitutional values and ensure justice for all. The interpretation and application of constitutional values by the judicial system has had far-reaching impact, often even altering provisions of the Constitution itself. Although our legal system was originally based on the broad principles of the English common law, over the years it has been adapted to Indian traditions and been changed, for the better, by certain landmark verdicts.                          In Landmark Judgments that Changed India, former Supreme Court judge and eminent jurist Asok Kumar Ganguly analyses certain cases that led to the formation of new laws and changes to the legal system. Discussed in this book are judgments in cases such as Kesavananda Bharati v. State of Kerala that curtailed the power of Parliament to amend the Constitution; Maneka Gandhi v. Union of India and Others that defined personal liberty; and Golaknath v. State of Punjab, where it was ruled that amendments which infringe upon fundamental rights cannot be passed. Of special significance for law students and practitioners, this book is also an ideal guide for anyone interested in the changes made to Indian laws down the years, and the evolution of the judicial system to what it is today."},{"id":"46","name":"The Art of War (Chiron Academic Press - The Original Authoritative Edition)","author":"Sun Tzu","publication":"Chiron Academic Press; 1 edition (11 December 2015)","isbn":"8971227832","price":"850","category":"Business strategy And management","description":"THE ART OF WAR (Chinese: 孫子兵法; pinyin: Sūnzĭ bīngfǎ) is an ancient Chinese military treatise attributed to Sun Tzu, a high-ranking military general, strategist and tactician, and kindred to the Realpolitik of his time, termed in China as Legalism. The text is composed of 13 chapters, each of which is devoted to one aspect of warfare. It is commonly thought of as a definitive work on military strategy and tactics. It has been the most famous and influential of China's Seven Military Classics, and for the last two thousand years it remained the most important military treatise in Asia, where even the common people knew it by name. It has had an influence on Eastern and Western military thinking, business tactics, legal strategy and beyond.                          Beyond its military and intelligence applications from earliest days to the present time, THE ART OF WAR has been applied to many fields well outside of the military. Much of the text is about how to fight wars without actually having to do battle: it gives tips on how to outsmart one's opponent so that physical battle is not necessary. As such, it has found application as a training guide for many competitive endeavors that do not involve actual combat. There are business books applying its lessons to office politics and corporate strategy. Many companies make the book required reading for their key executives. The book is also popular among Western business management, who have turned to it for inspiration and advice on how to succeed in competitive business situations. It has also been applied to the field of education. The Art of War has been the subject of law books and legal articles on the trial process, including negotiation tactics and trial strategy."},{"id":"47","name":"Thinking, Fast and Slow (Penguin Press Non-Fiction) ","author":"Daniel Kahneman","publication":"Penguin (28 May 2015)","isbn":"0141033576","price":"267","category":"Business strategy And management","description":"In Thinking, Fast and Slow, Kahneman takes us on a groundbreaking tour of the mind and explains the two systems that drive the way we think and make choices. One system is fast, intuitive and emotional, the other is slower, more deliberative and more logical. Kahneman exposes the extraordinary capabilities - and also the faults and biases - of fast thinking and reveals the pervasive influence of intuitive impressions on our thoughts and behaviour. The importance of properly framing risks, the effects of cognitive biases on how we view others, the dangers of prediction, the right ways to develop skills, the pros and cons of fear and optimism, the difference between our experience and memory of events, the real components of happiness-each of these can be understood only by knowing how the two systems work together to shape our judgments and decisions."},{"id":"48","name":"Elon Musk: How the Billionaire CEO of SpaceX and Tesla is Shaping our Future","author":"Ashlee Vance","publication":"harper","isbn":"8971227888","price":"699","category":"Business strategy And management","description":"South African born Elon Musk is the renowned entrepreneur and innovator behind PayPal, SpaceX, Tesla, and SolarCity. Musk wants to save our planet; he wants to send citizens into space, to form a colony on Mars; he wants to make money while doing these things; and he wants us all to know about it. He is the real-life inspiration for the Iron Man series of films starring Robert Downey Junior.                          The personal tale of Musk’s life comes with all the trappings one associates with a great, drama-filled story. He was a freakishly bright kid who was bullied brutally at school, and abused by his father. In the midst of these rough conditions, and the violence of apartheid South Africa, Musk still thrived academically and attended the University of Pennsylvania, where he paid his own way through school by turning his house into a club and throwing massive parties.                          He started a pair of huge dot-com successes, including PayPal, which eBay acquired for $1.5 billion in 2002. Musk was forced out as CEO and so began his lost years in which he decided to go it alone and baffled friends by investing his fortune in rockets and electric cars. Meanwhile Musk’s marriage disintegrated as his technological obsessions took over his life ... "},{"id":"49","name":"Zero to One: Note on Start Ups, or How to Build the Future","author":"Peter Thiel,Blake Masters","publication":"Random House (18 September 2014)","isbn":"0753555190","price":"499","category":"Business strategy And management","description":"What valuable company is nobody building? The next Bill Gates will not build an operating system. The next Larry Page or Sergey Brin won't make a search engine. If you are copying these guys, you aren't learning from them. It's easier to copy a model than to make something new: doing what we already know how to do takes the world from 1 to n, adding more of something familiar. Every new creation goes from 0 to 1. This book is about how to get there. Peter Thiel has built multiple breakthrough companies, and Zero to One shows how. (Elon Musk, CEO of SpaceX and Tesla). This book delivers completely new and refreshing ideas on how to create value in the world. (Mark Zuckerberg, CEO of Facebook). When a risk taker writes a book, read it. In the case of Peter Thiel, read it twice. Or, to be safe, three times. This is a classic. (Nassim Nicholas Taleb, author of The Black Swan)."},{"id":"50","name":"When Your Strategy Stalls, What Will You Do? (Harvard Management Dilemmas.)","author":"Harvard Business Review ","publication":"Harvard Business Review Press (29 January 2005)","isbn":"159139712X","price":"649","category":"Businees strategy And management","description":"Every strategy has a shelf life. The trick is to recognize signs of strategic decay before they erode your company’s competitiveness. In this book, managers will immerse themselves in a range of dilemmas—Is it time to go global? Is cross-selling the answer, or a new problem? Should we stick to the core, or look for growth beyond it?—that managers in every company face as they seek to keep their companies growing profitably.                         When facing a difficult management challenge, wouldn't it be great if you could turn to a panel of experts to help guide you to the right decision? Now you can, with books from the Management Dilemmas series. Drawn from the pages of Harvard Business Review, these interactive, solutions-oriented guides allow readers to access the wisdom of leading experts as they tackle familiar and perplexing business situations. These engagingly written books will help managers improve problem-solving skills and make better judgment calls under fire."},{"id":"51","name":"How to Prepare for QuantITative Aptitude for CAT","author":"Arun Sharma","publication":"TMH; 6 edition (1 June 2014)","isbn":"933920512X","price":"745","category":"Management exams","description":"Arun Sharma's Quantitative Aptitude for CAT has been a bestseller in this segment for many years and has evolved into a 'must read' book for this topic. The revised sixth edition is as per the latest trends for CAT questions and also relate itself to other managment entrance exam like XAT, SNAP, IIFT etc. Quantitative Aptitude is one of the most challenging components of MBA entrance examinations and the author, in his inimitable style has adopted a scientific yet student-friendly approach to discussing the topic."},{"id":"52","name":"Crack the IIM Indore IPM Entrance Examination","author":"dueNorth Academics","publication":"Pearson Education; Second edition (15 February 2016)","isbn":"9332560153","price":"499","category":"Management exams","description":"n the second edition the author has enhanced the content as per the latest trend in examination . As a result this book would act as a highly focused and effective resource for students aspiring to crack the 'Integrated Program in Management (IPM)' entrance examination.                          The book has been designed keeping in mind the busy schedule of aspirants , currently preparing for their 10+2 examinations , by providing 'to-the-point' concepts and 'quality' practice questions. The last five years examination pattern and the scope of Aptitude Tests as conducted by IIM Indore have also been incorporated across all chapters. It would also be a useful resource to crack undergraduate level entrance examinations of 'University of Delhi', 'Symbiosis', 'Narsee Monjee (NMIMS) and other key BBA offering institutions."},{"id":"53","name":"The Official Guide for GMAT Review 2016 with Online Question Bank and Exclusive Video","author":"GMAC (Graduate Management Admission Council) (Author)","publication":"Wiley India Private Limited (2 July 2015)","isbn":"8126554614","price":"1799","category":"Management exams","description":"With 25% brand new content, The Official Guide for the GMAT Review 2016 delivers more than 900 retired questions from the official GMAT exam, complete with answer explanations and a 100-question diagnostic exam to help focus your test preparation efforts."},{"id":"54","name":"THE MEGA YEARBOOK 2016 - Current Affairs  General Knowledge for Competitive Exams","author":"Disha Experts","publication":"Disha Publication; 1 edition (2015)","isbn":"9385846337","price":"350","category":"Management exams","description":"In the age of technology, we are swimming in an ocean of information - digital information, printed information - but who to trust and who will serve the quality. Disha's The MEGA Year Book 2016 is heralded as one of the most authoritative and comprehensive compendiums of high-quality reference materials on all subjects - Current Affairs, Panorama, Geography, History, Polity, Economy, Finance, General Science, Environment, Art Culture, Sports, Healthcare, Education  Career, English Language and many more. The MEGA Year Book 2016 has been designed to cater to aspirants of various competitive exams like Civil services, Banks, Railways, UPSC and PSC exams and Quiz Competition across the country. It equally serves teachers, researchers, media persons, planners, avid readers and laymen. The book is equally useful for school students who want to increase their knowledge/ awareness. The book has a very vast coverage and covers everything and anything related to current affairs general knowledge. The book can be divided into 2 broad parts: Part A - Current Affairs; Part B - General Knowledge Current Affairs contains Latest Articles, India Timelines, World Timelines, Top 500 People, Events, Ideas and Issues, Emerging Trends, INDIA - SWOT, Cause  Effects, Unanswered Questions, Coming Up 2016 etc. General Knowledge contains India Panorama, World Panorama, Most Famous People of All Time, Geography, History, Polity, Economy, Business, General Science, Ecology and Environment, Art And Culture, Sports, Healthcare, Communication, News Media, Education  Career, IT Computers, English Language, General Aptitude, Technology, FUN ZONE, etc. Single Book Multiple Features:"},{"id":"55","name":"Quantitative Aptitude Quantum CAT Common Admission Tests For Admission into IIMs","author":" Sarvesh K. Verma","publication":"Arihant; 5th edition (2015)","isbn":"935203225X","price":"775","category":"Management exams","description":"The present study resource is a well designed module for developing And sharpening the concepts of Quantitative Aptitude. The book has been divided into 21 chapters namely Fundamentals, Averages, Alligations, Ratio, Proportion And Variation, Percentages, Profit, Loss And Discount, CI/SI/Instalments, Time And Work, Time, Speed And Distance, Mensuration, Trigonometry, Geometry, Elements of Algebra, Theory of Equations, Set Theory, Logarithm, Functions And Graph, Sequence, Series And Progressions, Permutations And Combinations, Probability and Co-ordinate Geometry. Each chapter in the book begins with the brief summary of the topics covered in the chapter as well as point wise importance of certain topics has been covered in between the chapters. The conceptual part has been covered in detail with theory and ample number of supportive solved examples which will help in getting a hold over a concept. Along with the solved examples number of introductory exercises have also been provided in between the chapter once a certain topic is complete. Each chapter ends with three levelled practice exercises including the final round which will help in final revision and self analysis of the level of understanding of a particular chapter. For effective comprehension of the concepts on which the questions are based, answers along with Hints And Solutions to these practice exercises have also been provided. The book also contains last five years’ (2011-2015) solved papers of SNAP, XAT And IIFT to help aspirants to get an insight into the recent years’ examination papers."},{"id":"56","name":"16 Years' Solved Papers 2000-2015 Karnataka CET Engineering Entrance","author":"Arihant Experts","publication":"Arihant; Fifth edition (15 September 2015)","isbn":"9352510259","price":"350","category":"Engineering Entrance","description":"An editorial team of highly skilled professionals at Arihant, works hand in glove to ensure that the students receive the best and accurate content through our books. From inception till the book comes out from print, the whole team comprising of authors, editors, proofreaders and various other involved in shaping the book put in their best efforts, knowledge and experience to produce the rigorous content the students receive. Keeping in mind the specific requirements of the students and various examinations, the carefully designed exam oriented and exam ready content comes out only after intensive research and analysis. The experts have adopted whole new style of presenting the content which is easily understandable, leaving behind the old traditional methods which once used to be the most effective. They have been developing the latest content And updates as per the needs and requirements of the students making our books a hallmark for quality and reliability for the past 15 years. "},{"id":"57","name":"IAS Mains Compulsory English (Solved Papers 2001-2014) for Civil Services Examination","author":" A P Bhardwaj","publication":"Access Publishing; First edition ","isbn":"9383454504","price":"125","category":"Exams By UPSC","description":"This book is an authentic and genuine compilation of answers to previous years’ papers of English of the UPSC main examination. It aims to provide students with a feel of the answers thereby making them familiar with the way to answer them. The answers have been carefully prepared and are backed by a decade of experience of the author in coaching aspirants. "},{"id":"58","name":"Current Affairs 2016 for Competitive Exams - UPSC/ State PCS/ SSC/ Banking/ Insurance/ Railways/ BBA/ MBA/ Defence","author":"Disha Experts ","publication":"Disha Publication; 1 edition","isbn":"9385846531","price":"99","category":"Exams By UPSC","description":"Current Affairs forms a very important portion of one's preparation for the various competitive exams. The Current Affairs 2016 has been designed to capture the day-to-day happenings in and around our country. It is essential for aspirants to keep themselves updated as just knowing things can get them more marks in such exams. Moreover Current Affairs prove to be very important tool to handle GD and PI. It comes in handy for the aspirants of UPSC, SSC, Banking, Insurance, Railways, Engg. Services and AFCAT etc. Info graphics, bar charts and pie charts have facilitated information quickly and clearly. The information provided in the Current Affairs 2016 is in line with the analysis of previous years' competitive exams papers which will help aspirants update on all happenings across India and the world. Salient Features of the book: • The India - SWOT Analysis - covers the social, political And economic aspects. • Timeline 2015 - covering the timeline of important dates from Jan-Dec 2015 of India and the World. • Bills And Acts - Provides features and details of the bills and acts that were passed in 2015. • Policies And Schemes - Provides features and details of the policies and schemes that were launched in 2015. • Top 500 - covering the Top 500 People, Events, Ideas and Issues that raised their head in 2015. • 25+ Analytical Articles - capturing the hottest of the issues of 2015. • Coming Up 2016 - capturing the events to come and what to expect in 2016. • Emerging Trends features the most significant news that captured the attention of people. • Cause And Effects illustrates the causes and effects of the various things that occurred in 2015. "},{"id":"59","name":"Hinduism and its culture wars ","author":"Vamsee Juluri","publication":"Westland","isbn":"8457988712","price":"90","category":"History","description":" Vamsee Juluri’s seminal 2012 review essay from The India Site on the writings of Amartya Sen, Pankaj Mishra, Martha Nussbaum, Wendy Doniger exposed for the first time within the scholarly community the serious flaws in the supposedly liberal-secular position being advanced by these writers. Arguing from within the sensibility of devout liberal Hindus who do not believe in exclusive religious nationalism, Juluri argued that these writers had turned their crusade against Hindutva into an egregiously misplaced existential attack on popular Hinduism. Widely read and commented on by lay readers and academics, this important review essay is essential reading for who anyone who cares for both Hinduism and secularism today. "},{"id":"60","name":"India's Struggle for Independence","author":"Bipan Chandra","publication":"Penguin India; Reprint edition","isbn":"0140107819","price":"190","category":"History","description":" In the midway I realized that it is truly a pro-congress or pro-nationalist book. But, then also I proceeded. There are times, when it tries to justify the stand of Congress on critical matters. A reader must read it with this 'bias' in mind of authors because as already been said by others that most of the authors are from JNU and in some way or other are associated with different government institutions. However, it is a good read in terms of it's style of presenting history. In fact, one can easily find that history is not merely about memorizing the dates, it is more about seeing the undercurrent of thoughts which were determinant in making that date historical. So in all, I would suggest it is for a mature reader not an amateur one. --Gyan Vikas Feb 15, 2012                          an extract from the book goes the end of 1907 brought another political trend to the fore. the impatient young men of bengal took to the path of individual heroism and revolutionary terrorism( a term we use without any pejorative meaning and for want for another term). I for one am at a loss as to how a renowned group of 5 historians are not able to find a proper term for our freedom fighters. well let me suggest some - radical extremists, ultra extremists and i am sure that if these wont fit one can easily come up with a little more reverent term than revolutionary terrorism interestingly in the chapter on freedom of press the authors mention how people from press were forced to write their content in such a way as to not incur the wrath of the administration. it seems to me that this particular term has been used just as the Britishers would use it albeit a bit mildly( by using revolutionary terrorism instead of flatly terrorism) and with an apology (that stands exposed). Penguin is a UK company. this statement seems to me a devise to flatter the publishers (present generation who most probably revere their colonial past) --Asim Dagar"},{"id":"61","name":"Forget Me Not, Stranger","author":"Novoneel Chakraborty","publication":"Ebury Press","isbn":"8184007302","price":"123","category":"Literature And Fiction","description":"I’m Rivanah Bannerjee, 23/F/Mumbai. Some of you might already know how my life is on a razor edge. Those of you who don’t, just know this: I may be killed soon. . . by the Stranger. I don’t know who or what he is: a ghost, a person or a figment of my imagination? All I know is he isn’t just one thing: he is sexy and scary, terrific and terrifying. What I don’t understand is why a young, harmless girl like me, who works in a big city, stays away from her parents and has a screwed-up love life, would be of any interest to him. Unless there is something about my own story that I do not know. . .                         In the hotly anticipated final instalment of the Stranger trilogy, Rivanah will learn the answers to her many questions—What is it that binds her to the dead Hiya? Who is the Stranger? Why has he been following her all this while?—leading to an intense, breath-taking climax."},{"id":"62","name":"The Monk Who Sold His Ferrari","author":"Robin Sharma","publication":"Jaico Publishing House; First edition","isbn":"817992162X","price":"95","category":"Literature And Fiction","description":"Everyone loves a good fable, and this is certainly one. The protagonist is Julian Mantle, a high-profile attorney with a whacked-out schedule and a shameful set of spiritual priorities. Of course it takes a crisis (heart attack) to give Mantle pause. And pause he does--suddenly selling all his beloved possessions to trek India in pursuit of a meaningful existence. The Himalayan gurus along the way give simple advice, such as, What lies behind you and what lies before you is nothing compared to what lies within you. Yet it is easy to forgive the story's simplicity because each kernel of wisdom is framed to address the persistent angst of Western white-collar professionals.                          Here is the story of Julian Mantle, a superstar lawyer whose out-of-balance lifestyle leads him to a near-fatal heart attack in a packed courtroom. His physical collapse brings him into a spiritual crisis that forces him to confront the condition of his life. Hoping to find happiness and fulfillment, he embarks upon an extraordinary odyssey to an ancient culture, where he discovers a powerful system to release the potential of his mind, body, and soul and learns to live with passion, purpose, and peace. Brilliantly blending ancient spiritual wisdom of the east with contemporary success principles of the West, this inspiring tale provides a step-by-step approach to living with greater courage, balance, abundance and joy."},{"id":"63","name":"Before we Visit the Goddess","author":" Chitra Banerjee Divakaruni","publication":"Simon And Schuster ","isbn":"1471146936","price":"339","category":"Literature And Fiction","description":"Chitra Banerjee Divakaruni is the author of sixteen books, including Oleander Girl, The Mistress of Spices, Sister of My Heart, Palace of Illusions and One Amazing Thing. Her work has appeared in The New Yorker, The Atlantic Monthly and The New York Times and has won, among other prizes, an American Book Award. Born in India, she currently lives in Texas and is the McDavid professor of Creative Writing at the University of Houston. "},{"id":"64","name":"A Game of Thrones: The Graphic Novels Volumes 1-4 (Boxed Set Edition)","author":"George R.R. Martin","publication":"Harper Voyager; Boxed Set edition","isbn":"0007950306","price":"2750","category":"Fantasy, Horror And Science Fiction","description":"George R. R. Martin’s epic fantasy masterwork A Game of Thrones is brought to life in the pages of these full-colour graphic novels. This set contains volumes 1 to 4 of a series that is sure to be one of the most coveted collaborations of the year.                          Winter is coming. Such is the stern motto of House Stark, the northernmost of the fiefdoms that owe allegiance to King Robert Baratheon in far-off King’s Landing. There Eddard Stark of Winterfell rules in Robert’s name. There his family dwells in peace and comfort: his proud wife, Catelyn; his sons Robb, Brandon, and Rickon; his daughters Sansa and Arya; and his bastard son, Jon Snow. Far to the north, behind the towering Wall, lie savage Wildings and worse – unnatural things relegated to myth during the centuries-long summer, but proving all too real and all too deadly in the turning of the season. Yet a more immediate threat lurks to the south, where Jon Arryn, the Hand of the King, has died under mysterious circumstances. Now Robert is riding north to Winterfell, bringing his queen, the lovely but cold Cersei, his son, the cruel, vainglorious Prince Joffrey, and the queen’s brothers Jamie and Tyrion of the powerful and wealthy House Lannister – the first a swordsman without equal, the second a dwarf whose stunted stature belies a brilliant mind. All are heading for Winterfell and a fateful encounter that will change the course of kingdoms.                          Meanwhile, across the Narrow Sea, Prince Viserys, heir of the fallen House Targaryen, which once ruled all of Westeros, schemes to reclaim the throne with an army of barbarian Dothraki—whose loyalty he will purchase in the only coin left to him: his beautiful yet innocent sister, Daenerys."},{"id":"65","name":"The Last Mile (Amos Decker Series)","author":"David Baldacci","publication":"Pan Macmillan India; Air Iri OME edition","isbn":"144727783X","price":"500","category":"Crime, Thriller And Mystery","description":"Melvin Mars awaits his fate on Death Row. He was one of America's most promising football stars until, aged twenty-years-old, he was arrested and convicted for the murder of his parents just as he was due to begin a very lucrative contract with the NFL.                          When Amos Decker, newly appointed special agent with the FBI, hears the news that Melvin was saved in the final seconds before his execution because someone has confessed to the killings, he persuades his boss to allow him to carry out an investigation into the Mars murders.                          There are facts about the case which don't add up, and as the investigation deepens, Decker and his team uncover layer upon layer of lies and deception which are rooted at a time in American history which most would rather forget, but some seem keen to remember.                          There is someone out there with a lot to hide, and a secret that everyone is looking for. A race against time ensues because, when revealed, that information threatens to tear apart the corridors of power at the very highest level."},{"id":"66","name":"George and the Blue Moon (George's Secret Key to the Universe)","author":"Lucy Hawking and Stephen Hawking","publication":"Doubleday Childrens","isbn":"0857533282","price":"413","category":"Children's And Young Adult","description":"George and his best friend, Annie have been selected as junior astronauts - part of a programme that trains up young people for a trip to Mars in the future. This is everything they've ever wanted - they get to be a part of up-to-the minute space discoveries and meet a bunch of new friends who are as fascinated by the universe as they are.                          But when they arrive at space camp, George and Annie quickly learn that strange things are happening - on Earth as well as up in our skies. Mysterious space missions are happening in secret, and the astronaut training they're undertaking gets scarier and scarier . . .                          The fifth adventure in this series by Lucy and Stephen Hawking - also containing up-to-the-minute scientific facts and information by the world's leading scientists."},{"id":"67","name":"A Court of Mist and Fury (A Court of Thorns and Roses)","author":"Sarah J. Maas","publication":"Bloomsbury Childrens","isbn":"140885788X","price":"279","category":"Fantasy, Science Fiction And Horror","description":"The stunning sequel to Sarah J. Maas' New York Times bestselling A Court of Thorns and Roses. Feyre survived Amarantha's clutches to return to the Spring Court - but at a steep cost. Though she now has the powers of the High Fae, her heart remains human, and it can't forget the terrible deeds she performed to save Tamlin's people. Nor has Feyre forgotten her bargain with Rhysand, High Lord of the feared Night Court. As Feyre navigates its dark web of politics, passion, and dazzling power, a greater evil looms - and she might be key to stopping it. But only if she can harness her harrowing gifts, heal her fractured soul, and decide how she wishes to shape her future - and the future of a world cleaved in two. With more than a million copies sold of her beloved Throne of Glass series, Sarah J. Maas's masterful storytelling brings this second book in her seductive and action-packed series to new heights."},{"id":"68","name":"One Perfect Summer","author":"Paige Toon","publication":"Simon And Schuster","isbn":"1849831289","price":"244","category":"Romance","description":"A Dorset summer, a chance meeting, and Joe and Alice, both 18, fall into step as if they have known each other forever. But their idyll is shattered as quickly as it began. Joe leaves without warning; Alice heads off to Cambridge University and slowly picks up the pieces of her broken heart.                          Years later, when she catches the attention of gorgeous, gifted, rich boy Lukas, Alice is carried along by his charm, swept up in his ambitious plans for a future together.                          Until news of Joe reaches her once more, but he's out of reach in a way that Alice could never have imagined. Life has moved on, the divide between them is now so great. Surely it is far too late to relive those perfect summer days of long ago?"},{"id":"69","name":"Dirty (Dive Bar 1) ","author":"Kylie Scott","publication":"Pan Macmillan India; Main Market Ed. edition","isbn":"1509806296","price":"299","category":"Romance","description":"The last thing Vaughan Hewson expects to find when he returns to his childhood home is a broken hearted bride in his shower, let alone the drama and chaos that comes with her.                          Lydia Green doesn't know whether to burn down the church or sit and cry in a corner. Discovering the love of your life is having an affair on your wedding day is bad enough. Finding out it's with his best man is another thing all together. She narrowly escapes tying the knot and meets Vaughan only hours later.                          Vaughan is the exact opposite of the picture perfect, respected businessman she thought she'd marry. This former musician-turned-bartender is rough around the edges and at a crossroads. But she already tried Mr. Right and discovered he's all wrong -- maybe it's time to give Mr. Right Now a chance"},{"id":"70","name":"No Safe Zone","author":"Adite Banerjee","publication":"Harlequin","isbn":"9351777758","price":"149","category":"Romance","description":"Qiara Rana will do anything to save her mentor and their non-government organization from ruin. Even if it means visiting the city she had vowed never to return to. But within a few hours of landing in New Delhi, she is being chased by a gunman and is a potential suspect in the murder of a high-profile businessman. The only person she can turn to for help is Kabir Shorey, the man who stood her up ten years ago. Past and present collide in a deadly plot of crime and greed that moves from the cosmopolitan streets of Delhi to the bazaars and villages of Rajasthan."},{"id":"71","name":"The Kiss of Life","author":"Emraan Hashmi and Bilal Siddiqi","publication":"Penguin","isbn":"0143426508","price":"271","category":"AutoBiography","description":"Every experience that we go through changes us and helps us grow. As we learn to laugh and cry, win and lose, share and care, the meaning of life and true happiness unfolds before us. Known for his bold forays into Bollywood, Emraan Hashmi walks us through his memories that have shaped him from a confused teenager who dabbled in a variety of things to finding his calling to the suave, smart and unorthodox actor he has become today. At the heart of his story lies the most important and transformative experience of his life—the period when his son, Ayyan, was battling with cancer. It reveals the man behind the limitless charm of Emraan Hashmi and how he dealt with his son’s illness. Honest, personal, bold and heart-warming, The Kiss of Life is about an actor and a father’s trials and triumphs."},{"id":"72","name":"India's Broken Tryst","author":"Tavleen Singh","publication":"Harper Collins India","isbn":"935177757X","price":"475","category":"Politics","description":"It was only after I became an adult that I began to ask questions about that famous tryst. Why was the speech made in English? Was Nehru just a romantic or a real leader? And did he not know when he talked of the world being asleep at midnight that it was not midnight everywhere?'                          Even sixty-seven years after it became a modern nation state, democratic India has been unable to meet the most basic needs of its people. A dangerous mix of colonialism, socialism and statism has brought about this situation. India's people, both rich and poor, have been at the mercy of a political class whose motive for being in public life is power and pelf rather than public service.                          From one of the country's most experienced and respected journalists, India's Broken Tryst is a bold analysis of why this state of affairs has come to pass - why has the Indian state failed to live up to the promise made 'long years ago at the stroke of the midnight hour'?"},{"id":"73","name":"The Industries of the Future ","author":"Alec Ross","publication":"Simon And Schuster","isbn":"B00UDCNJYO","price":"1379","category":"Economics","description":"Leading innovation expert Alec Ross explains what’s next for the world: the advances and stumbling blocks that will emerge in the next ten years, and how we can navigate them.                          While Alec Ross was working as Senior Advisor for Innovation to the Secretary of State, he traveled to forty-one countries, exploring the latest advances coming out of every continent. From startup hubs in Kenya to RAndD labs in South Korea, Ross has seen what the future holds.                          In The Industries of the Future, Ross shows us what changes are coming in the next ten years, highlighting the best opportunities for progress and explaining why countries thrive or sputter. He examines the specific fields that will most shape our economic future, including robotics, cybersecurity, the commercialization of genomics, the next step for big data, and the coming impact of digital technology on money and markets.                          In each of these realms, Ross addresses the toughest questions: How will we adapt to the changing nature of work? Is the prospect of cyberwar sparking the next arms race? How can the world’s rising nations hope to match Silicon Valley in creating their own innovation hotspots? And what can today’s parents do to prepare their children for tomorrow?                          Ross blends storytelling and economic analysis to give a vivid and informed perspective on how sweeping global trends are affecting the ways we live. Incorporating the insights of leaders ranging from tech moguls to defense experts, The Industries of the Future takes the intimidating, complex topics that many of us know to be important and boils them down into clear, plainspoken language. This is an essential book for understanding how the world works—now and tomorrow—and a must-read for businesspeople in every sector, from every country. "},{"id":"74","name":"Headscarves and Hymens: Why the Middle East Needs a Sexual Revolution","author":"Mona Eltahawy","publication":" W And N ","isbn":"1780228872","price":"255","category":"Gender Studies","description":"Headscarves and Hymens explodes the myth that we should stand back and watch while women are disempowered and abused in the name of religion.                          In this laceratingly honest account, Eltahawy takes aim both at attitudes in the Middle East and at the western liberals who mistake misogyny for cultural difference. Her argument is clear: unless political revolution in the Arab world is accompanied by social and sexual revolution, no progress will be made.                          Headscarves and Hymens is the book the world has been crying out for: a powerful, fearless account of what it really means to be a woman in the Muslim world."},{"id":"75","name":"America's War for the Greater Middle East: A Military History ","author":"Andrew J. Bacevich","publication":"Random House ","isbn":"0553393936","price":"1603","category":"History","description":"From the end of World War II until 1980, virtually no American soldiers were killed in action while serving in the Greater Middle East. Since 1990, virtually no American soldiers have been killed in action anywhere else. What caused this shift? Andrew J. Bacevich, one of the country’s most respected voices on foreign affairs, offers an incisive critical history of this ongoing military enterprise—now more than thirty years old and with no end in sight.                          During the 1980s, Bacevich argues, a great transition occurred. As the Cold War wound down, the United States initiated a new conflict—a War for the Greater Middle East—that continues to the present day. The long twilight struggle with the Soviet Union had involved only occasional and sporadic fighting. But as this new war unfolded, hostilities became persistent. From the Balkans and East Africa to the Persian Gulf and Central Asia, U.S. forces embarked upon a seemingly endless series of campaigns across the Islamic world. Few achieved anything remotely like conclusive success. Instead, actions undertaken with expectations of promoting peace and stability produced just the opposite. As a consequence, phrases like “permanent war” and “open-ended war” have become part of everyday discourse.                          Connecting the dots in a way no other historian has done before, Bacevich weaves a compelling narrative out of episodes as varied as the Beirut bombing of 1983, the Mogadishu firefight of 1993, the invasion of Iraq in 2003, and the rise of ISIS in the present decade. Understanding what America’s costly military exertions have wrought requires seeing these seemingly discrete events as parts of a single war. It also requires identifying the errors of judgment made by political leaders in both parties and by senior military officers who share responsibility for what has become a monumental march to folly. This Bacevich unflinchingly does.                          A twenty-year army veteran who served in Vietnam, Andrew J. Bacevich brings the full weight of his expertise to this vitally important subject. America’s War for the Greater Middle East is a bracing after-action report from the front lines of history. It will fundamentally change the way we view America’s engagement in the world’s most volatile region."}]}